Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/include/proc/p32mk0512gpk100.h
extern volatile __LATGbits_t LATGbits __asm__ ("LATG") __attribute__((section("sfrs"), address(0xBF860630)));
extern volatile uint32_t        LATGCLR __attribute__((section("sfrs"),address(0xBF860634)));
extern volatile uint32_t        LATGSET __attribute__((section("sfrs"),address(0xBF860638)));
extern volatile uint32_t        LATGINV __attribute__((section("sfrs"),address(0xBF86063C)));
#define ODCG ODCG
extern volatile uint32_t   ODCG __attribute__((section("sfrs"), address(0xBF860640)));
typedef union {
  struct {
    uint32_t ODCG0:1;
    uint32_t ODCG1:1;
    uint32_t :4;
    uint32_t ODCG6:1;
    uint32_t ODCG7:1;
    uint32_t ODCG8:1;
    uint32_t ODCG9:1;
    uint32_t ODCG10:1;
    uint32_t ODCG11:1;
    uint32_t ODCG12:1;
    uint32_t ODCG13:1;
    uint32_t ODCG14:1;
    uint32_t ODCG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCGbits_t;
extern volatile __ODCGbits_t ODCGbits __asm__ ("ODCG") __attribute__((section("sfrs"), address(0xBF860640)));
extern volatile uint32_t        ODCGCLR __attribute__((section("sfrs"),address(0xBF860644)));
extern volatile uint32_t        ODCGSET __attribute__((section("sfrs"),address(0xBF860648)));
extern volatile uint32_t        ODCGINV __attribute__((section("sfrs"),address(0xBF86064C)));
#define CNPUG CNPUG
extern volatile uint32_t   CNPUG __attribute__((section("sfrs"), address(0xBF860650)));
typedef union {
  struct {
    uint32_t CNPUG0:1;
    uint32_t CNPUG1:1;
    uint32_t :4;
    uint32_t CNPUG6:1;
    uint32_t CNPUG7:1;
    uint32_t CNPUG8:1;
    uint32_t CNPUG9:1;
    uint32_t CNPUG10:1;
    uint32_t CNPUG11:1;
    uint32_t CNPUG12:1;
    uint32_t CNPUG13:1;
    uint32_t CNPUG14:1;
    uint32_t CNPUG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUGbits_t;
extern volatile __CNPUGbits_t CNPUGbits __asm__ ("CNPUG") __attribute__((section("sfrs"), address(0xBF860650)));
extern volatile uint32_t        CNPUGCLR __attribute__((section("sfrs"),address(0xBF860654)));
extern volatile uint32_t        CNPUGSET __attribute__((section("sfrs"),address(0xBF860658)));
extern volatile uint32_t        CNPUGINV __attribute__((section("sfrs"),address(0xBF86065C)));
#define CNPDG CNPDG
extern volatile uint32_t   CNPDG __attribute__((section("sfrs"), address(0xBF860660)));
typedef union {
  struct {
    uint32_t CNPDG0:1;
    uint32_t CNPDG1:1;
    uint32_t :4;
    uint32_t CNPDG6:1;
    uint32_t CNPDG7:1;
    uint32_t CNPDG8:1;
    uint32_t CNPDG9:1;
    uint32_t CNPDG10:1;
    uint32_t CNPDG11:1;
    uint32_t CNPDG12:1;
    uint32_t CNPDG13:1;
    uint32_t CNPDG14:1;
    uint32_t CNPDG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDGbits_t;
extern volatile __CNPDGbits_t CNPDGbits __asm__ ("CNPDG") __attribute__((section("sfrs"), address(0xBF860660)));
extern volatile uint32_t        CNPDGCLR __attribute__((section("sfrs"),address(0xBF860664)));
extern volatile uint32_t        CNPDGSET __attribute__((section("sfrs"),address(0xBF860668)));
extern volatile uint32_t        CNPDGINV __attribute__((section("sfrs"),address(0xBF86066C)));
#define CNCONG CNCONG
extern volatile uint32_t   CNCONG __attribute__((section("sfrs"), address(0xBF860670)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONGbits_t;
extern volatile __CNCONGbits_t CNCONGbits __asm__ ("CNCONG") __attribute__((section("sfrs"), address(0xBF860670)));
extern volatile uint32_t        CNCONGCLR __attribute__((section("sfrs"),address(0xBF860674)));
extern volatile uint32_t        CNCONGSET __attribute__((section("sfrs"),address(0xBF860678)));
extern volatile uint32_t        CNCONGINV __attribute__((section("sfrs"),address(0xBF86067C)));
#define CNENG CNENG
extern volatile uint32_t   CNENG __attribute__((section("sfrs"), address(0xBF860680)));
typedef union {
  struct {
    uint32_t CNIEG0:1;
    uint32_t CNIEG1:1;
    uint32_t :4;
    uint32_t CNIEG6:1;
    uint32_t CNIEG7:1;
    uint32_t CNIEG8:1;
    uint32_t CNIEG9:1;
    uint32_t CNIEG10:1;
    uint32_t CNIEG11:1;
    uint32_t CNIEG12:1;
    uint32_t CNIEG13:1;
    uint32_t CNIEG14:1;
    uint32_t CNIEG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENGbits_t;
extern volatile __CNENGbits_t CNENGbits __asm__ ("CNENG") __attribute__((section("sfrs"), address(0xBF860680)));
extern volatile uint32_t        CNENGCLR __attribute__((section("sfrs"),address(0xBF860684)));
extern volatile uint32_t        CNENGSET __attribute__((section("sfrs"),address(0xBF860688)));
extern volatile uint32_t        CNENGINV __attribute__((section("sfrs"),address(0xBF86068C)));
#define CNSTATG CNSTATG
extern volatile uint32_t   CNSTATG __attribute__((section("sfrs"), address(0xBF860690)));
typedef union {
  struct {
    uint32_t CNSTATG0:1;
    uint32_t CNSTATG1:1;
    uint32_t :4;
    uint32_t CNSTATG6:1;
    uint32_t CNSTATG7:1;
    uint32_t CNSTATG8:1;
    uint32_t CNSTATG9:1;
    uint32_t CNSTATG10:1;
    uint32_t CNSTATG11:1;
    uint32_t CNSTATG12:1;
    uint32_t CNSTATG13:1;
    uint32_t CNSTATG14:1;
    uint32_t CNSTATG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATGbits_t;
extern volatile __CNSTATGbits_t CNSTATGbits __asm__ ("CNSTATG") __attribute__((section("sfrs"), address(0xBF860690)));
extern volatile uint32_t        CNSTATGCLR __attribute__((section("sfrs"),address(0xBF860694)));
extern volatile uint32_t        CNSTATGSET __attribute__((section("sfrs"),address(0xBF860698)));
extern volatile uint32_t        CNSTATGINV __attribute__((section("sfrs"),address(0xBF86069C)));
#define CNNEG CNNEG
extern volatile uint32_t   CNNEG __attribute__((section("sfrs"), address(0xBF8606A0)));
typedef struct {
  uint32_t CNNEG0:1;
  uint32_t CNNEG1:1;
  uint32_t :4;
  uint32_t CNNEG6:1;
  uint32_t CNNEG7:1;
  uint32_t CNNEG8:1;
  uint32_t CNNEG9:1;
  uint32_t CNNEG10:1;
  uint32_t CNNEG11:1;
  uint32_t CNNEG12:1;
  uint32_t CNNEG13:1;
  uint32_t CNNEG14:1;
  uint32_t CNNEG15:1;
} __CNNEGbits_t;
extern volatile __CNNEGbits_t CNNEGbits __asm__ ("CNNEG") __attribute__((section("sfrs"), address(0xBF8606A0)));
extern volatile uint32_t        CNNEGCLR __attribute__((section("sfrs"),address(0xBF8606A4)));
extern volatile uint32_t        CNNEGSET __attribute__((section("sfrs"),address(0xBF8606A8)));
extern volatile uint32_t        CNNEGINV __attribute__((section("sfrs"),address(0xBF8606AC)));
#define CNFG CNFG
extern volatile uint32_t   CNFG __attribute__((section("sfrs"), address(0xBF8606B0)));
typedef struct {
  uint32_t CNFG0:1;
  uint32_t CNFG1:1;
  uint32_t :4;
  uint32_t CNFG6:1;
  uint32_t CNFG7:1;
  uint32_t CNFG8:1;
  uint32_t CNFG9:1;
  uint32_t CNFG10:1;
  uint32_t CNFG11:1;
  uint32_t CNFG12:1;
  uint32_t CNFG13:1;
  uint32_t CNFG14:1;
  uint32_t CNFG15:1;
} __CNFGbits_t;
extern volatile __CNFGbits_t CNFGbits __asm__ ("CNFG") __attribute__((section("sfrs"), address(0xBF8606B0)));
extern volatile uint32_t        CNFGCLR __attribute__((section("sfrs"),address(0xBF8606B4)));
extern volatile uint32_t        CNFGSET __attribute__((section("sfrs"),address(0xBF8606B8)));
extern volatile uint32_t        CNFGINV __attribute__((section("sfrs"),address(0xBF8606BC)));
#define ADCCON1 ADCCON1
extern volatile uint32_t   ADCCON1 __attribute__((section("sfrs"), address(0xBF887000)));
typedef struct {
  uint32_t DMABL:3;
  uint32_t STRGLVL:1;
  uint32_t IRQVS:3;
  uint32_t :2;
  uint32_t FSPBCLKEN:1;
  uint32_t FSSCLKEN:1;
  uint32_t CVDEN:1;
  uint32_t AICPMPEN:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t STRGSRC:5;
  uint32_t SELRES:2;
  uint32_t FRACT:1;
  uint32_t TRBSLV:3;
  uint32_t TRBMST:3;
  uint32_t TRBERR:1;
  uint32_t TRBEN:1;
} __ADCCON1bits_t;
extern volatile __ADCCON1bits_t ADCCON1bits __asm__ ("ADCCON1") __attribute__((section("sfrs"), address(0xBF887000)));
extern volatile uint32_t        ADCCON1CLR __attribute__((section("sfrs"),address(0xBF887004)));
extern volatile uint32_t        ADCCON1SET __attribute__((section("sfrs"),address(0xBF887008)));
extern volatile uint32_t        ADCCON1INV __attribute__((section("sfrs"),address(0xBF88700C)));
#define ADCCON2 ADCCON2
extern volatile uint32_t   ADCCON2 __attribute__((section("sfrs"), address(0xBF887010)));
typedef struct {
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t ADCEIS:3;
  uint32_t :1;
  uint32_t ADCEIOVR:1;
  uint32_t EOSIEN:1;
  uint32_t REFFLTIEN:1;
  uint32_t BGVRIEN:1;
  uint32_t SAMC:10;
  uint32_t CVDCPL:3;
  uint32_t EOSRDY:1;
  uint32_t REFFLT:1;
  uint32_t BGVRRDY:1;
} __ADCCON2bits_t;
extern volatile __ADCCON2bits_t ADCCON2bits __asm__ ("ADCCON2") __attribute__((section("sfrs"), address(0xBF887010)));
extern volatile uint32_t        ADCCON2CLR __attribute__((section("sfrs"),address(0xBF887014)));
extern volatile uint32_t        ADCCON2SET __attribute__((section("sfrs"),address(0xBF887018)));
extern volatile uint32_t        ADCCON2INV __attribute__((section("sfrs"),address(0xBF88701C)));
#define ADCCON3 ADCCON3
extern volatile uint32_t   ADCCON3 __attribute__((section("sfrs"), address(0xBF887020)));
typedef struct {
  uint32_t ADINSEL:6;
  uint32_t GSWTRG:1;
  uint32_t GLSWTRG:1;
  uint32_t RQCNVRT:1;
  uint32_t SAMP:1;
  uint32_t UPDRDY:1;
  uint32_t UPDIEN:1;
  uint32_t TRGSUSP:1;
  uint32_t VREFSEL:3;
  uint32_t DIGEN0:1;
  uint32_t DIGEN1:1;
  uint32_t DIGEN2:1;
  uint32_t DIGEN3:1;
  uint32_t DIGEN4:1;
  uint32_t DIGEN5:1;
  uint32_t :1;
  uint32_t DIGEN7:1;
  uint32_t CONCLKDIV:6;
  uint32_t ADCSEL:2;
} __ADCCON3bits_t;
extern volatile __ADCCON3bits_t ADCCON3bits __asm__ ("ADCCON3") __attribute__((section("sfrs"), address(0xBF887020)));
extern volatile uint32_t        ADCCON3CLR __attribute__((section("sfrs"),address(0xBF887024)));
extern volatile uint32_t        ADCCON3SET __attribute__((section("sfrs"),address(0xBF887028)));
extern volatile uint32_t        ADCCON3INV __attribute__((section("sfrs"),address(0xBF88702C)));
#define ADCTRGMODE ADCTRGMODE
extern volatile uint32_t   ADCTRGMODE __attribute__((section("sfrs"), address(0xBF887030)));
typedef struct {
  uint32_t SSAMPEN0:1;
  uint32_t SSAMPEN1:1;
  uint32_t SSAMPEN2:1;
  uint32_t SSAMPEN3:1;
  uint32_t SSAMPEN4:1;
  uint32_t SSAMPEN5:1;
  uint32_t :2;
  uint32_t STRGEN0:1;
  uint32_t STRGEN1:1;
  uint32_t STRGEN2:1;
  uint32_t STRGEN3:1;
  uint32_t STRGEN4:1;
  uint32_t STRGEN5:1;
  uint32_t :2;
  uint32_t SH0ALT:2;
  uint32_t SH1ALT:2;
  uint32_t SH2ALT:2;
  uint32_t SH3ALT:2;
  uint32_t SH4ALT:2;
  uint32_t SH5ALT:2;
} __ADCTRGMODEbits_t;
extern volatile __ADCTRGMODEbits_t ADCTRGMODEbits __asm__ ("ADCTRGMODE") __attribute__((section("sfrs"), address(0xBF887030)));
extern volatile uint32_t        ADCTRGMODECLR __attribute__((section("sfrs"),address(0xBF887034)));
extern volatile uint32_t        ADCTRGMODESET __attribute__((section("sfrs"),address(0xBF887038)));
extern volatile uint32_t        ADCTRGMODEINV __attribute__((section("sfrs"),address(0xBF88703C)));
#define ADCIMCON1 ADCIMCON1
extern volatile uint32_t   ADCIMCON1 __attribute__((section("sfrs"), address(0xBF887040)));
typedef struct {
  uint32_t SIGN0:1;
  uint32_t DIFF0:1;
  uint32_t SIGN1:1;
  uint32_t DIFF1:1;
  uint32_t SIGN2:1;
  uint32_t DIFF2:1;
  uint32_t SIGN3:1;
  uint32_t DIFF3:1;
  uint32_t SIGN4:1;
  uint32_t DIFF4:1;
  uint32_t SIGN5:1;
  uint32_t DIFF5:1;
  uint32_t SIGN6:1;
  uint32_t DIFF6:1;
  uint32_t SIGN7:1;
  uint32_t DIFF7:1;
  uint32_t SIGN8:1;
  uint32_t DIFF8:1;
  uint32_t SIGN9:1;
  uint32_t DIFF9:1;
  uint32_t SIGN10:1;
  uint32_t DIFF10:1;
  uint32_t SIGN11:1;
  uint32_t DIFF11:1;
  uint32_t SIGN12:1;
  uint32_t DIFF12:1;
  uint32_t SIGN13:1;
  uint32_t DIFF13:1;
  uint32_t SIGN14:1;
  uint32_t DIFF14:1;
  uint32_t SIGN15:1;
  uint32_t DIFF15:1;
} __ADCIMCON1bits_t;
