Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/include/proc/p32mk0512gpk100.h
  .extern SBT1RD0          /* 0xBF8F8450 */
  .extern SBT1WR0          /* 0xBF8F8458 */
  .extern SBT1REG2         /* 0xBF8F8480 */
  .extern SBT1RD2          /* 0xBF8F8490 */
  .extern SBT1WR2          /* 0xBF8F8498 */
  .extern SBT1REG3         /* 0xBF8F84A0 */
  .extern SBT1RD3          /* 0xBF8F84B0 */
  .extern SBT1WR3          /* 0xBF8F84B8 */
  .extern SBT1REG4         /* 0xBF8F84C0 */
  .extern SBT1RD4          /* 0xBF8F84D0 */
  .extern SBT1WR4          /* 0xBF8F84D8 */
  .extern SBT1REG5         /* 0xBF8F84E0 */
  .extern SBT1RD5          /* 0xBF8F84F0 */
  .extern SBT1WR5          /* 0xBF8F84F8 */
  .extern SBT1REG6         /* 0xBF8F8500 */
  .extern SBT1RD6          /* 0xBF8F8510 */
  .extern SBT1WR6          /* 0xBF8F8518 */
  .extern SBT1REG7         /* 0xBF8F8520 */
  .extern SBT1RD7          /* 0xBF8F8530 */
  .extern SBT1WR7          /* 0xBF8F8538 */
  .extern SBT1REG8         /* 0xBF8F8540 */
  .extern SBT1RD8          /* 0xBF8F8550 */
  .extern SBT1WR8          /* 0xBF8F8558 */
  .extern SBT2ELOG1        /* 0xBF8F8820 */
  .extern SBT2ELOG2        /* 0xBF8F8824 */
  .extern SBT2ECON         /* 0xBF8F8828 */
  .extern SBT2ECLRS        /* 0xBF8F8830 */
  .extern SBT2ECLRM        /* 0xBF8F8838 */
  .extern SBT2REG0         /* 0xBF8F8840 */
  .extern SBT2RD0          /* 0xBF8F8850 */
  .extern SBT2WR0          /* 0xBF8F8858 */
  .extern SBT2REG1         /* 0xBF8F8860 */
  .extern SBT2RD1          /* 0xBF8F8870 */
  .extern SBT2WR1          /* 0xBF8F8878 */
  .extern SBT2REG2         /* 0xBF8F8880 */
  .extern SBT2RD2          /* 0xBF8F8890 */
  .extern SBT2WR2          /* 0xBF8F8898 */
  .extern SBT3ELOG1        /* 0xBF8F8C20 */
  .extern SBT3ELOG2        /* 0xBF8F8C24 */
  .extern SBT3ECON         /* 0xBF8F8C28 */
  .extern SBT3ECLRS        /* 0xBF8F8C30 */
  .extern SBT3ECLRM        /* 0xBF8F8C38 */
  .extern SBT3REG0         /* 0xBF8F8C40 */
  .extern SBT3RD0          /* 0xBF8F8C50 */
  .extern SBT3WR0          /* 0xBF8F8C58 */
  .extern SBT3REG1         /* 0xBF8F8C60 */
  .extern SBT3RD1          /* 0xBF8F8C70 */
  .extern SBT3WR1          /* 0xBF8F8C78 */
  .extern SBT3REG2         /* 0xBF8F8C80 */
  .extern SBT3RD2          /* 0xBF8F8C90 */
  .extern SBT3WR2          /* 0xBF8F8C98 */
  .extern DEVCFG3          /* 0xBFC03FC0 */
  .extern DEVCFG2          /* 0xBFC03FC4 */
  .extern DEVCFG1          /* 0xBFC03FC8 */
  .extern DEVCFG0          /* 0xBFC03FCC */
  .extern DEVCP            /* 0xBFC03FDC */
  .extern DEVSIGN          /* 0xBFC03FEC */
  .extern SEQ              /* 0xBFC03FF0 */
  .extern DEVADC0          /* 0xBFC45000 */
  .extern DEVADC1          /* 0xBFC45004 */
  .extern DEVADC2          /* 0xBFC45008 */
  .extern DEVADC3          /* 0xBFC4500C */
  .extern DEVADC4          /* 0xBFC45010 */
  .extern DEVADC5          /* 0xBFC45014 */
  .extern DEVADC7          /* 0xBFC45018 */
  .extern DEVSN0           /* 0xBFC45020 */
  .extern DEVSN1           /* 0xBFC45024 */
  .extern DEVSN2           /* 0xBFC45028 */
  .extern DEVSN3           /* 0xBFC4502C */
  .extern DEVEE0           /* 0xBFC45030 */
  .extern DEVEE1           /* 0xBFC45034 */
  .extern DEVEE2           /* 0xBFC45038 */
  .extern DEVEE3           /* 0xBFC4503C */
  .extern ADEVCFG3         /* 0xBFC03F40 */
  .extern ADEVCFG2         /* 0xBFC03F44 */
  .extern ADEVCFG1         /* 0xBFC03F48 */
  .extern ADEVCFG0         /* 0xBFC03F4C */
  .extern ADEVCP           /* 0xBFC03F5C */
  .extern ADEVSIGN         /* 0xBFC03F6C */
  .extern ASEQ             /* 0xBFC03F70 */
  .extern AUBADEVCFG3      /* 0xBFC23F40 */
  .extern AUBADEVCFG2      /* 0xBFC23F44 */
  .extern AUBADEVCFG1      /* 0xBFC23F48 */
  .extern AUBADEVCFG0      /* 0xBFC23F4C */
  .extern AUBADEVCP        /* 0xBFC23F5C */
  .extern AUBADEVSIGN      /* 0xBFC23F6C */
  .extern AUBASEQ          /* 0xBFC23F70 */
  .extern UBADEVCFG3       /* 0xBFC23FC0 */
  .extern UBADEVCFG2       /* 0xBFC23FC4 */
  .extern UBADEVCFG1       /* 0xBFC23FC8 */
  .extern UBADEVCFG0       /* 0xBFC23FCC */
  .extern UBADEVCP         /* 0xBFC23FDC */
  .extern UBADEVSIGN       /* 0xBFC23FEC */
  .extern UBASEQ           /* 0xBFC23FF0 */
  .extern ABF1DEVCFG3      /* 0xBFC43F40 */
  .extern ABF1DEVCFG2      /* 0xBFC43F44 */
  .extern ABF1DEVCFG1      /* 0xBFC43F48 */
  .extern ABF1DEVCFG0      /* 0xBFC43F4C */
  .extern ABF1DEVCP        /* 0xBFC43F5C */
  .extern ABF1DEVSIGN      /* 0xBFC43F6C */
  .extern ABF1SEQ          /* 0xBFC43F70 */
  .extern BF1DEVCFG3       /* 0xBFC43FC0 */
  .extern BF1DEVCFG2       /* 0xBFC43FC4 */
  .extern BF1DEVCFG1       /* 0xBFC43FC8 */
  .extern BF1DEVCFG0       /* 0xBFC43FCC */
  .extern BF1DEVCP         /* 0xBFC43FDC */
  .extern BF1DEVSIGN       /* 0xBFC43FEC */
  .extern BF1SEQ           /* 0xBFC43FF0 */
  .extern ABF2DEVCFG3      /* 0xBFC63F40 */
  .extern ABF2DEVCFG2      /* 0xBFC63F44 */
  .extern ABF2DEVCFG1      /* 0xBFC63F48 */
  .extern ABF2DEVCFG0      /* 0xBFC63F4C */
  .extern ABF2DEVCP        /* 0xBFC63F5C */
  .extern ABF2DEVSIGN      /* 0xBFC63F6C */
  .extern ABF2SEQ          /* 0xBFC63F70 */
  .extern BF2DEVCFG3       /* 0xBFC63FC0 */
  .extern BF2DEVCFG2       /* 0xBFC63FC4 */
  .extern BF2DEVCFG1       /* 0xBFC63FC8 */
  .extern BF2DEVCFG0       /* 0xBFC63FCC */
  .extern BF2DEVCP         /* 0xBFC63FDC */
  .extern BF2DEVSIGN       /* 0xBFC63FEC */
  .extern BF2SEQ           /* 0xBFC63FF0 */
#else
#error Unknown language!
#endif

#define _CFGCON_TDOEN_POSITION                   0x00000000
#define _CFGCON_TDOEN_MASK                       0x00000001
#define _CFGCON_TDOEN_LENGTH                     0x00000001

#define _CFGCON_TROEN_POSITION                   0x00000002
#define _CFGCON_TROEN_MASK                       0x00000004
#define _CFGCON_TROEN_LENGTH                     0x00000001

#define _CFGCON_JTAGEN_POSITION                  0x00000003
#define _CFGCON_JTAGEN_MASK                      0x00000008
#define _CFGCON_JTAGEN_LENGTH                    0x00000001

#define _CFGCON_ECCCON_POSITION                  0x00000004
#define _CFGCON_ECCCON_MASK                      0x00000030
#define _CFGCON_ECCCON_LENGTH                    0x00000002

#define _CFGCON_IOANCPEN_POSITION                0x00000007
#define _CFGCON_IOANCPEN_MASK                    0x00000080
#define _CFGCON_IOANCPEN_LENGTH                  0x00000001

