Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/include/proc/p32mk0512gpk100.h
#define _IPC14_U2RXIS_POSITION                   0x00000008
#define _IPC14_U2RXIS_MASK                       0x00000300
#define _IPC14_U2RXIS_LENGTH                     0x00000002

#define _IPC14_U2RXIP_POSITION                   0x0000000A
#define _IPC14_U2RXIP_MASK                       0x00001C00
#define _IPC14_U2RXIP_LENGTH                     0x00000003

#define _IPC14_U2TXIS_POSITION                   0x00000010
#define _IPC14_U2TXIS_MASK                       0x00030000
#define _IPC14_U2TXIS_LENGTH                     0x00000002

#define _IPC14_U2TXIP_POSITION                   0x00000012
#define _IPC14_U2TXIP_MASK                       0x001C0000
#define _IPC14_U2TXIP_LENGTH                     0x00000003

#define _IPC14_I2C2BIS_POSITION                  0x00000018
#define _IPC14_I2C2BIS_MASK                      0x03000000
#define _IPC14_I2C2BIS_LENGTH                    0x00000002

#define _IPC14_I2C2BIP_POSITION                  0x0000001A
#define _IPC14_I2C2BIP_MASK                      0x1C000000
#define _IPC14_I2C2BIP_LENGTH                    0x00000003

#define _IPC14_w_POSITION                        0x00000000
#define _IPC14_w_MASK                            0xFFFFFFFF
#define _IPC14_w_LENGTH                          0x00000020

#define _IPC15_I2C2SIS_POSITION                  0x00000000
#define _IPC15_I2C2SIS_MASK                      0x00000003
#define _IPC15_I2C2SIS_LENGTH                    0x00000002

#define _IPC15_I2C2SIP_POSITION                  0x00000002
#define _IPC15_I2C2SIP_MASK                      0x0000001C
#define _IPC15_I2C2SIP_LENGTH                    0x00000003

#define _IPC15_I2C2MIS_POSITION                  0x00000008
#define _IPC15_I2C2MIS_MASK                      0x00000300
#define _IPC15_I2C2MIS_LENGTH                    0x00000002

#define _IPC15_I2C2MIP_POSITION                  0x0000000A
#define _IPC15_I2C2MIP_MASK                      0x00001C00
#define _IPC15_I2C2MIP_LENGTH                    0x00000003

#define _IPC15_U3EIS_POSITION                    0x00000010
#define _IPC15_U3EIS_MASK                        0x00030000
#define _IPC15_U3EIS_LENGTH                      0x00000002

#define _IPC15_U3EIP_POSITION                    0x00000012
#define _IPC15_U3EIP_MASK                        0x001C0000
#define _IPC15_U3EIP_LENGTH                      0x00000003

#define _IPC15_U3RXIS_POSITION                   0x00000018
#define _IPC15_U3RXIS_MASK                       0x03000000
#define _IPC15_U3RXIS_LENGTH                     0x00000002

#define _IPC15_U3RXIP_POSITION                   0x0000001A
#define _IPC15_U3RXIP_MASK                       0x1C000000
#define _IPC15_U3RXIP_LENGTH                     0x00000003

#define _IPC15_w_POSITION                        0x00000000
#define _IPC15_w_MASK                            0xFFFFFFFF
#define _IPC15_w_LENGTH                          0x00000020

#define _IPC16_U3TXIS_POSITION                   0x00000000
#define _IPC16_U3TXIS_MASK                       0x00000003
#define _IPC16_U3TXIS_LENGTH                     0x00000002

#define _IPC16_U3TXIP_POSITION                   0x00000002
#define _IPC16_U3TXIP_MASK                       0x0000001C
#define _IPC16_U3TXIP_LENGTH                     0x00000003

#define _IPC16_U4EIS_POSITION                    0x00000008
#define _IPC16_U4EIS_MASK                        0x00000300
#define _IPC16_U4EIS_LENGTH                      0x00000002

#define _IPC16_U4EIP_POSITION                    0x0000000A
#define _IPC16_U4EIP_MASK                        0x00001C00
#define _IPC16_U4EIP_LENGTH                      0x00000003

#define _IPC16_U4RXIS_POSITION                   0x00000010
#define _IPC16_U4RXIS_MASK                       0x00030000
#define _IPC16_U4RXIS_LENGTH                     0x00000002

#define _IPC16_U4RXIP_POSITION                   0x00000012
#define _IPC16_U4RXIP_MASK                       0x001C0000
#define _IPC16_U4RXIP_LENGTH                     0x00000003

#define _IPC16_U4TXIS_POSITION                   0x00000018
#define _IPC16_U4TXIS_MASK                       0x03000000
#define _IPC16_U4TXIS_LENGTH                     0x00000002

#define _IPC16_U4TXIP_POSITION                   0x0000001A
#define _IPC16_U4TXIP_MASK                       0x1C000000
#define _IPC16_U4TXIP_LENGTH                     0x00000003

#define _IPC16_w_POSITION                        0x00000000
#define _IPC16_w_MASK                            0xFFFFFFFF
#define _IPC16_w_LENGTH                          0x00000020

#define _IPC17_U5EIS_POSITION                    0x00000000
#define _IPC17_U5EIS_MASK                        0x00000003
#define _IPC17_U5EIS_LENGTH                      0x00000002

#define _IPC17_U5EIP_POSITION                    0x00000002
#define _IPC17_U5EIP_MASK                        0x0000001C
#define _IPC17_U5EIP_LENGTH                      0x00000003

#define _IPC17_U5RXIS_POSITION                   0x00000008
#define _IPC17_U5RXIS_MASK                       0x00000300
#define _IPC17_U5RXIS_LENGTH                     0x00000002

#define _IPC17_U5RXIP_POSITION                   0x0000000A
#define _IPC17_U5RXIP_MASK                       0x00001C00
#define _IPC17_U5RXIP_LENGTH                     0x00000003

#define _IPC17_U5TXIS_POSITION                   0x00000010
#define _IPC17_U5TXIS_MASK                       0x00030000
#define _IPC17_U5TXIS_LENGTH                     0x00000002

#define _IPC17_U5TXIP_POSITION                   0x00000012
#define _IPC17_U5TXIP_MASK                       0x001C0000
#define _IPC17_U5TXIP_LENGTH                     0x00000003

#define _IPC17_CTMUIS_POSITION                   0x00000018
#define _IPC17_CTMUIS_MASK                       0x03000000
#define _IPC17_CTMUIS_LENGTH                     0x00000002

#define _IPC17_CTMUIP_POSITION                   0x0000001A
#define _IPC17_CTMUIP_MASK                       0x1C000000
#define _IPC17_CTMUIP_LENGTH                     0x00000003

#define _IPC17_w_POSITION                        0x00000000
#define _IPC17_w_MASK                            0xFFFFFFFF
#define _IPC17_w_LENGTH                          0x00000020

#define _IPC18_DMA0IS_POSITION                   0x00000000
#define _IPC18_DMA0IS_MASK                       0x00000003
#define _IPC18_DMA0IS_LENGTH                     0x00000002

