Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/include/proc/p32mk0512gpk100.h
#define _CNCONC_ON_POSITION                      0x0000000F
#define _CNCONC_ON_MASK                          0x00008000
#define _CNCONC_ON_LENGTH                        0x00000001

#define _CNCONC_w_POSITION                       0x00000000
#define _CNCONC_w_MASK                           0xFFFFFFFF
#define _CNCONC_w_LENGTH                         0x00000020

#define _CNENC_CNIEC0_POSITION                   0x00000000
#define _CNENC_CNIEC0_MASK                       0x00000001
#define _CNENC_CNIEC0_LENGTH                     0x00000001

#define _CNENC_CNIEC1_POSITION                   0x00000001
#define _CNENC_CNIEC1_MASK                       0x00000002
#define _CNENC_CNIEC1_LENGTH                     0x00000001

#define _CNENC_CNIEC2_POSITION                   0x00000002
#define _CNENC_CNIEC2_MASK                       0x00000004
#define _CNENC_CNIEC2_LENGTH                     0x00000001

#define _CNENC_CNIEC6_POSITION                   0x00000006
#define _CNENC_CNIEC6_MASK                       0x00000040
#define _CNENC_CNIEC6_LENGTH                     0x00000001

#define _CNENC_CNIEC7_POSITION                   0x00000007
#define _CNENC_CNIEC7_MASK                       0x00000080
#define _CNENC_CNIEC7_LENGTH                     0x00000001

#define _CNENC_CNIEC8_POSITION                   0x00000008
#define _CNENC_CNIEC8_MASK                       0x00000100
#define _CNENC_CNIEC8_LENGTH                     0x00000001

#define _CNENC_CNIEC9_POSITION                   0x00000009
#define _CNENC_CNIEC9_MASK                       0x00000200
#define _CNENC_CNIEC9_LENGTH                     0x00000001

#define _CNENC_CNIEC10_POSITION                  0x0000000A
#define _CNENC_CNIEC10_MASK                      0x00000400
#define _CNENC_CNIEC10_LENGTH                    0x00000001

#define _CNENC_CNIEC11_POSITION                  0x0000000B
#define _CNENC_CNIEC11_MASK                      0x00000800
#define _CNENC_CNIEC11_LENGTH                    0x00000001

#define _CNENC_CNIEC12_POSITION                  0x0000000C
#define _CNENC_CNIEC12_MASK                      0x00001000
#define _CNENC_CNIEC12_LENGTH                    0x00000001

#define _CNENC_CNIEC13_POSITION                  0x0000000D
#define _CNENC_CNIEC13_MASK                      0x00002000
#define _CNENC_CNIEC13_LENGTH                    0x00000001

#define _CNENC_CNIEC14_POSITION                  0x0000000E
#define _CNENC_CNIEC14_MASK                      0x00004000
#define _CNENC_CNIEC14_LENGTH                    0x00000001

#define _CNENC_CNIEC15_POSITION                  0x0000000F
#define _CNENC_CNIEC15_MASK                      0x00008000
#define _CNENC_CNIEC15_LENGTH                    0x00000001

#define _CNENC_w_POSITION                        0x00000000
#define _CNENC_w_MASK                            0xFFFFFFFF
#define _CNENC_w_LENGTH                          0x00000020

#define _CNSTATC_CNSTATC0_POSITION               0x00000000
#define _CNSTATC_CNSTATC0_MASK                   0x00000001
#define _CNSTATC_CNSTATC0_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC1_POSITION               0x00000001
#define _CNSTATC_CNSTATC1_MASK                   0x00000002
#define _CNSTATC_CNSTATC1_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC2_POSITION               0x00000002
#define _CNSTATC_CNSTATC2_MASK                   0x00000004
#define _CNSTATC_CNSTATC2_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC6_POSITION               0x00000006
#define _CNSTATC_CNSTATC6_MASK                   0x00000040
#define _CNSTATC_CNSTATC6_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC7_POSITION               0x00000007
#define _CNSTATC_CNSTATC7_MASK                   0x00000080
#define _CNSTATC_CNSTATC7_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC8_POSITION               0x00000008
#define _CNSTATC_CNSTATC8_MASK                   0x00000100
#define _CNSTATC_CNSTATC8_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC9_POSITION               0x00000009
#define _CNSTATC_CNSTATC9_MASK                   0x00000200
#define _CNSTATC_CNSTATC9_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC10_POSITION              0x0000000A
#define _CNSTATC_CNSTATC10_MASK                  0x00000400
#define _CNSTATC_CNSTATC10_LENGTH                0x00000001

#define _CNSTATC_CNSTATC11_POSITION              0x0000000B
#define _CNSTATC_CNSTATC11_MASK                  0x00000800
#define _CNSTATC_CNSTATC11_LENGTH                0x00000001

#define _CNSTATC_CNSTATC12_POSITION              0x0000000C
#define _CNSTATC_CNSTATC12_MASK                  0x00001000
#define _CNSTATC_CNSTATC12_LENGTH                0x00000001

#define _CNSTATC_CNSTATC13_POSITION              0x0000000D
#define _CNSTATC_CNSTATC13_MASK                  0x00002000
#define _CNSTATC_CNSTATC13_LENGTH                0x00000001

#define _CNSTATC_CNSTATC14_POSITION              0x0000000E
#define _CNSTATC_CNSTATC14_MASK                  0x00004000
#define _CNSTATC_CNSTATC14_LENGTH                0x00000001

#define _CNSTATC_CNSTATC15_POSITION              0x0000000F
#define _CNSTATC_CNSTATC15_MASK                  0x00008000
#define _CNSTATC_CNSTATC15_LENGTH                0x00000001

#define _CNSTATC_w_POSITION                      0x00000000
#define _CNSTATC_w_MASK                          0xFFFFFFFF
#define _CNSTATC_w_LENGTH                        0x00000020

#define _CNNEC_CNNEC0_POSITION                   0x00000000
#define _CNNEC_CNNEC0_MASK                       0x00000001
#define _CNNEC_CNNEC0_LENGTH                     0x00000001

#define _CNNEC_CNNEC1_POSITION                   0x00000001
#define _CNNEC_CNNEC1_MASK                       0x00000002
#define _CNNEC_CNNEC1_LENGTH                     0x00000001

#define _CNNEC_CNNEC2_POSITION                   0x00000002
#define _CNNEC_CNNEC2_MASK                       0x00000004
#define _CNNEC_CNNEC2_LENGTH                     0x00000001

#define _CNNEC_CNNEC6_POSITION                   0x00000006
#define _CNNEC_CNNEC6_MASK                       0x00000040
#define _CNNEC_CNNEC6_LENGTH                     0x00000001

#define _CNNEC_CNNEC7_POSITION                   0x00000007
#define _CNNEC_CNNEC7_MASK                       0x00000080
#define _CNNEC_CNNEC7_LENGTH                     0x00000001

#define _CNNEC_CNNEC8_POSITION                   0x00000008
#define _CNNEC_CNNEC8_MASK                       0x00000100
#define _CNNEC_CNNEC8_LENGTH                     0x00000001

