Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/include/proc/p32mk0512gpk100.h
#define _CNNED_CNNED13_POSITION                  0x0000000D
#define _CNNED_CNNED13_MASK                      0x00002000
#define _CNNED_CNNED13_LENGTH                    0x00000001

#define _CNNED_CNNED14_POSITION                  0x0000000E
#define _CNNED_CNNED14_MASK                      0x00004000
#define _CNNED_CNNED14_LENGTH                    0x00000001

#define _CNNED_CNNED15_POSITION                  0x0000000F
#define _CNNED_CNNED15_MASK                      0x00008000
#define _CNNED_CNNED15_LENGTH                    0x00000001

#define _CNFD_CNFD1_POSITION                     0x00000001
#define _CNFD_CNFD1_MASK                         0x00000002
#define _CNFD_CNFD1_LENGTH                       0x00000001

#define _CNFD_CNFD2_POSITION                     0x00000002
#define _CNFD_CNFD2_MASK                         0x00000004
#define _CNFD_CNFD2_LENGTH                       0x00000001

#define _CNFD_CNFD3_POSITION                     0x00000003
#define _CNFD_CNFD3_MASK                         0x00000008
#define _CNFD_CNFD3_LENGTH                       0x00000001

#define _CNFD_CNFD4_POSITION                     0x00000004
#define _CNFD_CNFD4_MASK                         0x00000010
#define _CNFD_CNFD4_LENGTH                       0x00000001

#define _CNFD_CNFD5_POSITION                     0x00000005
#define _CNFD_CNFD5_MASK                         0x00000020
#define _CNFD_CNFD5_LENGTH                       0x00000001

#define _CNFD_CNFD6_POSITION                     0x00000006
#define _CNFD_CNFD6_MASK                         0x00000040
#define _CNFD_CNFD6_LENGTH                       0x00000001

#define _CNFD_CNFD8_POSITION                     0x00000008
#define _CNFD_CNFD8_MASK                         0x00000100
#define _CNFD_CNFD8_LENGTH                       0x00000001

#define _CNFD_CNFD12_POSITION                    0x0000000C
#define _CNFD_CNFD12_MASK                        0x00001000
#define _CNFD_CNFD12_LENGTH                      0x00000001

#define _CNFD_CNFD13_POSITION                    0x0000000D
#define _CNFD_CNFD13_MASK                        0x00002000
#define _CNFD_CNFD13_LENGTH                      0x00000001

#define _CNFD_CNFD14_POSITION                    0x0000000E
#define _CNFD_CNFD14_MASK                        0x00004000
#define _CNFD_CNFD14_LENGTH                      0x00000001

#define _CNFD_CNFD15_POSITION                    0x0000000F
#define _CNFD_CNFD15_MASK                        0x00008000
#define _CNFD_CNFD15_LENGTH                      0x00000001

#define _SRCON0D_SR0D1_POSITION                  0x00000001
#define _SRCON0D_SR0D1_MASK                      0x00000002
#define _SRCON0D_SR0D1_LENGTH                    0x00000001

#define _SRCON0D_SR0D2_POSITION                  0x00000002
#define _SRCON0D_SR0D2_MASK                      0x00000004
#define _SRCON0D_SR0D2_LENGTH                    0x00000001

#define _SRCON0D_SR0D3_POSITION                  0x00000003
#define _SRCON0D_SR0D3_MASK                      0x00000008
#define _SRCON0D_SR0D3_LENGTH                    0x00000001

#define _SRCON0D_SR0D4_POSITION                  0x00000004
#define _SRCON0D_SR0D4_MASK                      0x00000010
#define _SRCON0D_SR0D4_LENGTH                    0x00000001

#define _SRCON0D_SR0D5_POSITION                  0x00000005
#define _SRCON0D_SR0D5_MASK                      0x00000020
#define _SRCON0D_SR0D5_LENGTH                    0x00000001

#define _SRCON0D_SR0D6_POSITION                  0x00000006
#define _SRCON0D_SR0D6_MASK                      0x00000040
#define _SRCON0D_SR0D6_LENGTH                    0x00000001

#define _SRCON0D_SR0D8_POSITION                  0x00000008
#define _SRCON0D_SR0D8_MASK                      0x00000100
#define _SRCON0D_SR0D8_LENGTH                    0x00000001

#define _SRCON1D_SR1D1_POSITION                  0x00000001
#define _SRCON1D_SR1D1_MASK                      0x00000002
#define _SRCON1D_SR1D1_LENGTH                    0x00000001

#define _SRCON1D_SR1D2_POSITION                  0x00000002
#define _SRCON1D_SR1D2_MASK                      0x00000004
#define _SRCON1D_SR1D2_LENGTH                    0x00000001

#define _SRCON1D_SR1D3_POSITION                  0x00000003
#define _SRCON1D_SR1D3_MASK                      0x00000008
#define _SRCON1D_SR1D3_LENGTH                    0x00000001

#define _SRCON1D_SR1D4_POSITION                  0x00000004
#define _SRCON1D_SR1D4_MASK                      0x00000010
#define _SRCON1D_SR1D4_LENGTH                    0x00000001

#define _SRCON1D_SR1D5_POSITION                  0x00000005
#define _SRCON1D_SR1D5_MASK                      0x00000020
#define _SRCON1D_SR1D5_LENGTH                    0x00000001

#define _SRCON1D_SR1D6_POSITION                  0x00000006
#define _SRCON1D_SR1D6_MASK                      0x00000040
#define _SRCON1D_SR1D6_LENGTH                    0x00000001

#define _SRCON1D_SR1D8_POSITION                  0x00000008
#define _SRCON1D_SR1D8_MASK                      0x00000100
#define _SRCON1D_SR1D8_LENGTH                    0x00000001

#define _ANSELE_ANSE0_POSITION                   0x00000000
#define _ANSELE_ANSE0_MASK                       0x00000001
#define _ANSELE_ANSE0_LENGTH                     0x00000001

#define _ANSELE_ANSE1_POSITION                   0x00000001
#define _ANSELE_ANSE1_MASK                       0x00000002
#define _ANSELE_ANSE1_LENGTH                     0x00000001

#define _ANSELE_ANSE8_POSITION                   0x00000008
#define _ANSELE_ANSE8_MASK                       0x00000100
#define _ANSELE_ANSE8_LENGTH                     0x00000001

#define _ANSELE_ANSE9_POSITION                   0x00000009
#define _ANSELE_ANSE9_MASK                       0x00000200
#define _ANSELE_ANSE9_LENGTH                     0x00000001

#define _ANSELE_ANSE12_POSITION                  0x0000000C
#define _ANSELE_ANSE12_MASK                      0x00001000
#define _ANSELE_ANSE12_LENGTH                    0x00000001

#define _ANSELE_ANSE13_POSITION                  0x0000000D
#define _ANSELE_ANSE13_MASK                      0x00002000
#define _ANSELE_ANSE13_LENGTH                    0x00000001

#define _ANSELE_ANSE14_POSITION                  0x0000000E
#define _ANSELE_ANSE14_MASK                      0x00004000
#define _ANSELE_ANSE14_LENGTH                    0x00000001

#define _ANSELE_ANSE15_POSITION                  0x0000000F
#define _ANSELE_ANSE15_MASK                      0x00008000
#define _ANSELE_ANSE15_LENGTH                    0x00000001

#define _ANSELE_w_POSITION                       0x00000000
#define _ANSELE_w_MASK                           0xFFFFFFFF
#define _ANSELE_w_LENGTH                         0x00000020

#define _TRISE_TRISE0_POSITION                   0x00000000
#define _TRISE_TRISE0_MASK                       0x00000001
#define _TRISE_TRISE0_LENGTH                     0x00000001

