Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/include/proc/p32mk0512gpk100.h
#define _DSGPR6_DSGPR_POSITION                   0x00000000
#define _DSGPR6_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR6_DSGPR_LENGTH                     0x00000020

#define _DSGPR7_DSGPR_POSITION                   0x00000000
#define _DSGPR7_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR7_DSGPR_LENGTH                     0x00000020

#define _DSGPR8_DSGPR_POSITION                   0x00000000
#define _DSGPR8_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR8_DSGPR_LENGTH                     0x00000020

#define _DSGPR9_DSGPR_POSITION                   0x00000000
#define _DSGPR9_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR9_DSGPR_LENGTH                     0x00000020

#define _DSGPR10_DSGPR_POSITION                  0x00000000
#define _DSGPR10_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR10_DSGPR_LENGTH                    0x00000020

#define _DSGPR11_DSGPR_POSITION                  0x00000000
#define _DSGPR11_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR11_DSGPR_LENGTH                    0x00000020

#define _DSGPR12_DSGPR_POSITION                  0x00000000
#define _DSGPR12_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR12_DSGPR_LENGTH                    0x00000020

#define _DSGPR13_DSGPR_POSITION                  0x00000000
#define _DSGPR13_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR13_DSGPR_LENGTH                    0x00000020

#define _DSGPR14_DSGPR_POSITION                  0x00000000
#define _DSGPR14_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR14_DSGPR_LENGTH                    0x00000020

#define _DSGPR15_DSGPR_POSITION                  0x00000000
#define _DSGPR15_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR15_DSGPR_LENGTH                    0x00000020

#define _DSGPR16_DSGPR_POSITION                  0x00000000
#define _DSGPR16_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR16_DSGPR_LENGTH                    0x00000020

#define _DSGPR17_DSGPR_POSITION                  0x00000000
#define _DSGPR17_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR17_DSGPR_LENGTH                    0x00000020

#define _DSGPR18_DSGPR_POSITION                  0x00000000
#define _DSGPR18_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR18_DSGPR_LENGTH                    0x00000020

#define _DSGPR19_DSGPR_POSITION                  0x00000000
#define _DSGPR19_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR19_DSGPR_LENGTH                    0x00000020

#define _DSGPR20_DSGPR_POSITION                  0x00000000
#define _DSGPR20_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR20_DSGPR_LENGTH                    0x00000020

#define _DSGPR21_DSGPR_POSITION                  0x00000000
#define _DSGPR21_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR21_DSGPR_LENGTH                    0x00000020

#define _DSGPR22_DSGPR_POSITION                  0x00000000
#define _DSGPR22_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR22_DSGPR_LENGTH                    0x00000020

#define _DSGPR23_DSGPR_POSITION                  0x00000000
#define _DSGPR23_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR23_DSGPR_LENGTH                    0x00000020

#define _DSGPR24_DSGPR_POSITION                  0x00000000
#define _DSGPR24_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR24_DSGPR_LENGTH                    0x00000020

#define _DSGPR25_DSGPR_POSITION                  0x00000000
#define _DSGPR25_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR25_DSGPR_LENGTH                    0x00000020

#define _DSGPR26_DSGPR_POSITION                  0x00000000
#define _DSGPR26_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR26_DSGPR_LENGTH                    0x00000020

#define _DSGPR27_DSGPR_POSITION                  0x00000000
#define _DSGPR27_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR27_DSGPR_LENGTH                    0x00000020

#define _DSGPR28_DSGPR_POSITION                  0x00000000
#define _DSGPR28_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR28_DSGPR_LENGTH                    0x00000020

#define _DSGPR29_DSGPR_POSITION                  0x00000000
#define _DSGPR29_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR29_DSGPR_LENGTH                    0x00000020

#define _DSGPR30_DSGPR_POSITION                  0x00000000
#define _DSGPR30_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR30_DSGPR_LENGTH                    0x00000020

#define _DSGPR31_DSGPR_POSITION                  0x00000000
#define _DSGPR31_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR31_DSGPR_LENGTH                    0x00000020

#define _DSGPR32_DSGPR_POSITION                  0x00000000
#define _DSGPR32_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR32_DSGPR_LENGTH                    0x00000020

#define _SBFLAG_T0PGV_POSITION                   0x00000000
#define _SBFLAG_T0PGV_MASK                       0x00000001
#define _SBFLAG_T0PGV_LENGTH                     0x00000001

#define _SBFLAG_T1PGV_POSITION                   0x00000001
#define _SBFLAG_T1PGV_MASK                       0x00000002
#define _SBFLAG_T1PGV_LENGTH                     0x00000001

#define _SBFLAG_T2PGV_POSITION                   0x00000002
#define _SBFLAG_T2PGV_MASK                       0x00000004
#define _SBFLAG_T2PGV_LENGTH                     0x00000001

#define _SBFLAG_T3PGV_POSITION                   0x00000003
#define _SBFLAG_T3PGV_MASK                       0x00000008
#define _SBFLAG_T3PGV_LENGTH                     0x00000001

#define _SBT0ELOG1_CMD_POSITION                  0x00000000
#define _SBT0ELOG1_CMD_MASK                      0x00000007
#define _SBT0ELOG1_CMD_LENGTH                    0x00000003

#define _SBT0ELOG1_REGION_POSITION               0x00000004
#define _SBT0ELOG1_REGION_MASK                   0x000000F0
#define _SBT0ELOG1_REGION_LENGTH                 0x00000004

#define _SBT0ELOG1_INITID_POSITION               0x00000008
#define _SBT0ELOG1_INITID_MASK                   0x0000FF00
#define _SBT0ELOG1_INITID_LENGTH                 0x00000008

#define _SBT0ELOG1_CODE_POSITION                 0x00000018
#define _SBT0ELOG1_CODE_MASK                     0x0F000000
#define _SBT0ELOG1_CODE_LENGTH                   0x00000004

