Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/include/proc/p32mk0512gpk100.h
#define _ABF2DEVCFG0_DBGPER_POSITION             0x0000000C
#define _ABF2DEVCFG0_DBGPER_MASK                 0x00007000
#define _ABF2DEVCFG0_DBGPER_LENGTH               0x00000003

#define _ABF2DEVCFG0_SMCLR_POSITION              0x0000000F
#define _ABF2DEVCFG0_SMCLR_MASK                  0x00008000
#define _ABF2DEVCFG0_SMCLR_LENGTH                0x00000001

#define _ABF2DEVCFG0_SOSCGAIN_POSITION           0x00000010
#define _ABF2DEVCFG0_SOSCGAIN_MASK               0x00030000
#define _ABF2DEVCFG0_SOSCGAIN_LENGTH             0x00000002

#define _ABF2DEVCFG0_SOSCBOOST_POSITION          0x00000012
#define _ABF2DEVCFG0_SOSCBOOST_MASK              0x00040000
#define _ABF2DEVCFG0_SOSCBOOST_LENGTH            0x00000001

#define _ABF2DEVCFG0_POSCGAIN_POSITION           0x00000013
#define _ABF2DEVCFG0_POSCGAIN_MASK               0x00180000
#define _ABF2DEVCFG0_POSCGAIN_LENGTH             0x00000002

#define _ABF2DEVCFG0_POSCBOOST_POSITION          0x00000015
#define _ABF2DEVCFG0_POSCBOOST_MASK              0x00200000
#define _ABF2DEVCFG0_POSCBOOST_LENGTH            0x00000001

#define _ABF2DEVCFG0_POSCFGAIN_POSITION          0x00000016
#define _ABF2DEVCFG0_POSCFGAIN_MASK              0x00C00000
#define _ABF2DEVCFG0_POSCFGAIN_LENGTH            0x00000002

#define _ABF2DEVCFG0_POSCAGCDLY_POSITION         0x00000018
#define _ABF2DEVCFG0_POSCAGCDLY_MASK             0x03000000
#define _ABF2DEVCFG0_POSCAGCDLY_LENGTH           0x00000002

#define _ABF2DEVCFG0_POSCAGCRNG_POSITION         0x0000001A
#define _ABF2DEVCFG0_POSCAGCRNG_MASK             0x04000000
#define _ABF2DEVCFG0_POSCAGCRNG_LENGTH           0x00000001

#define _ABF2DEVCFG0_POSCAGC_POSITION            0x0000001B
#define _ABF2DEVCFG0_POSCAGC_MASK                0x08000000
#define _ABF2DEVCFG0_POSCAGC_LENGTH              0x00000001

#define _ABF2DEVCFG0_EJTAGBEN_POSITION           0x0000001E
#define _ABF2DEVCFG0_EJTAGBEN_MASK               0x40000000
#define _ABF2DEVCFG0_EJTAGBEN_LENGTH             0x00000001

#define _ABF2DEVCFG0_FDEBUG_POSITION             0x00000000
#define _ABF2DEVCFG0_FDEBUG_MASK                 0x00000003
#define _ABF2DEVCFG0_FDEBUG_LENGTH               0x00000002

#define _ABF2DEVCFG0_w_POSITION                  0x00000000
#define _ABF2DEVCFG0_w_MASK                      0xFFFFFFFF
#define _ABF2DEVCFG0_w_LENGTH                    0x00000020

#define _ABF2DEVCP_CP_POSITION                   0x0000001C
#define _ABF2DEVCP_CP_MASK                       0x10000000
#define _ABF2DEVCP_CP_LENGTH                     0x00000001

#define _ABF2DEVCP_w_POSITION                    0x00000000
#define _ABF2DEVCP_w_MASK                        0xFFFFFFFF
#define _ABF2DEVCP_w_LENGTH                      0x00000020

#define _ABF2SEQ_TSEQ_POSITION                   0x00000000
#define _ABF2SEQ_TSEQ_MASK                       0x0000FFFF
#define _ABF2SEQ_TSEQ_LENGTH                     0x00000010

#define _ABF2SEQ_CSEQ_POSITION                   0x00000010
#define _ABF2SEQ_CSEQ_MASK                       0xFFFF0000
#define _ABF2SEQ_CSEQ_LENGTH                     0x00000010

#define _ABF2SEQ_w_POSITION                      0x00000000
#define _ABF2SEQ_w_MASK                          0xFFFFFFFF
#define _ABF2SEQ_w_LENGTH                        0x00000020

#define _BF2DEVCFG3_USERID_POSITION              0x00000000
#define _BF2DEVCFG3_USERID_MASK                  0x0000FFFF
#define _BF2DEVCFG3_USERID_LENGTH                0x00000010

#define _BF2DEVCFG3_FUSBIDIO2_POSITION           0x00000016
#define _BF2DEVCFG3_FUSBIDIO2_MASK               0x00400000
#define _BF2DEVCFG3_FUSBIDIO2_LENGTH             0x00000001

#define _BF2DEVCFG3_FVBUSIO2_POSITION            0x00000017
#define _BF2DEVCFG3_FVBUSIO2_MASK                0x00800000
#define _BF2DEVCFG3_FVBUSIO2_LENGTH              0x00000001

#define _BF2DEVCFG3_PGL1WAY_POSITION             0x0000001B
#define _BF2DEVCFG3_PGL1WAY_MASK                 0x08000000
#define _BF2DEVCFG3_PGL1WAY_LENGTH               0x00000001

#define _BF2DEVCFG3_PMDL1WAY_POSITION            0x0000001C
#define _BF2DEVCFG3_PMDL1WAY_MASK                0x10000000
#define _BF2DEVCFG3_PMDL1WAY_LENGTH              0x00000001

#define _BF2DEVCFG3_IOL1WAY_POSITION             0x0000001D
#define _BF2DEVCFG3_IOL1WAY_MASK                 0x20000000
#define _BF2DEVCFG3_IOL1WAY_LENGTH               0x00000001

#define _BF2DEVCFG3_FUSBIDIO1_POSITION           0x0000001E
#define _BF2DEVCFG3_FUSBIDIO1_MASK               0x40000000
#define _BF2DEVCFG3_FUSBIDIO1_LENGTH             0x00000001

#define _BF2DEVCFG3_FVBUSIO1_POSITION            0x0000001F
#define _BF2DEVCFG3_FVBUSIO1_MASK                0x80000000
#define _BF2DEVCFG3_FVBUSIO1_LENGTH              0x00000001

#define _BF2DEVCFG3_w_POSITION                   0x00000000
#define _BF2DEVCFG3_w_MASK                       0xFFFFFFFF
#define _BF2DEVCFG3_w_LENGTH                     0x00000020

#define _BF2DEVCFG2_FPLLIDIV_POSITION            0x00000000
#define _BF2DEVCFG2_FPLLIDIV_MASK                0x00000007
#define _BF2DEVCFG2_FPLLIDIV_LENGTH              0x00000003

#define _BF2DEVCFG2_FPLLRNG_POSITION             0x00000004
#define _BF2DEVCFG2_FPLLRNG_MASK                 0x00000070
#define _BF2DEVCFG2_FPLLRNG_LENGTH               0x00000003

#define _BF2DEVCFG2_FPLLICLK_POSITION            0x00000007
#define _BF2DEVCFG2_FPLLICLK_MASK                0x00000080
#define _BF2DEVCFG2_FPLLICLK_LENGTH              0x00000001

#define _BF2DEVCFG2_FPLLMULT_POSITION            0x00000008
#define _BF2DEVCFG2_FPLLMULT_MASK                0x00007F00
#define _BF2DEVCFG2_FPLLMULT_LENGTH              0x00000007

#define _BF2DEVCFG2_FPLLODIV_POSITION            0x00000010
#define _BF2DEVCFG2_FPLLODIV_MASK                0x00070000
#define _BF2DEVCFG2_FPLLODIV_LENGTH              0x00000003

#define _BF2DEVCFG2_BORSEL_POSITION              0x0000001D
#define _BF2DEVCFG2_BORSEL_MASK                  0x20000000
#define _BF2DEVCFG2_BORSEL_LENGTH                0x00000001

#define _BF2DEVCFG2_UPLLEN_POSITION              0x0000001F
#define _BF2DEVCFG2_UPLLEN_MASK                  0x80000000
#define _BF2DEVCFG2_UPLLEN_LENGTH                0x00000001

#define _BF2DEVCFG2_w_POSITION                   0x00000000
#define _BF2DEVCFG2_w_MASK                       0xFFFFFFFF
#define _BF2DEVCFG2_w_LENGTH                     0x00000020

